micropython/micropython/stmhal/cmsis/stm32f767xx.h
/******************  Bit definition for FMC_PATT register  ******************/
#define  FMC_PATT_ATTSET3                  0x000000FFU        /*!<ATTSET3[7:0] bits (Attribute memory 3 setup time) */
#define  FMC_PATT_ATTSET3_0                0x00000001U        /*!<Bit 0 */
#define  FMC_PATT_ATTSET3_1                0x00000002U        /*!<Bit 1 */
#define  FMC_PATT_ATTSET3_2                0x00000004U        /*!<Bit 2 */
#define  FMC_PATT_ATTSET3_3                0x00000008U        /*!<Bit 3 */
#define  FMC_PATT_ATTSET3_4                0x00000010U        /*!<Bit 4 */
#define  FMC_PATT_ATTSET3_5                0x00000020U        /*!<Bit 5 */
#define  FMC_PATT_ATTSET3_6                0x00000040U        /*!<Bit 6 */
#define  FMC_PATT_ATTSET3_7                0x00000080U        /*!<Bit 7 */
#define  FMC_PATT_ATTWAIT3                 0x0000FF00U        /*!<ATTWAIT3[7:0] bits (Attribute memory 3 wait time) */
#define  FMC_PATT_ATTWAIT3_0               0x00000100U        /*!<Bit 0 */
#define  FMC_PATT_ATTWAIT3_1               0x00000200U        /*!<Bit 1 */
#define  FMC_PATT_ATTWAIT3_2               0x00000400U        /*!<Bit 2 */
#define  FMC_PATT_ATTWAIT3_3               0x00000800U        /*!<Bit 3 */
#define  FMC_PATT_ATTWAIT3_4               0x00001000U        /*!<Bit 4 */
#define  FMC_PATT_ATTWAIT3_5               0x00002000U        /*!<Bit 5 */
#define  FMC_PATT_ATTWAIT3_6               0x00004000U        /*!<Bit 6 */
#define  FMC_PATT_ATTWAIT3_7               0x00008000U        /*!<Bit 7 */
#define  FMC_PATT_ATTHOLD3                 0x00FF0000U        /*!<ATTHOLD3[7:0] bits (Attribute memory 3 hold time) */
#define  FMC_PATT_ATTHOLD3_0               0x00010000U        /*!<Bit 0 */
#define  FMC_PATT_ATTHOLD3_1               0x00020000U        /*!<Bit 1 */
#define  FMC_PATT_ATTHOLD3_2               0x00040000U        /*!<Bit 2 */
#define  FMC_PATT_ATTHOLD3_3               0x00080000U        /*!<Bit 3 */
#define  FMC_PATT_ATTHOLD3_4               0x00100000U        /*!<Bit 4 */
#define  FMC_PATT_ATTHOLD3_5               0x00200000U        /*!<Bit 5 */
#define  FMC_PATT_ATTHOLD3_6               0x00400000U        /*!<Bit 6 */
#define  FMC_PATT_ATTHOLD3_7               0x00800000U        /*!<Bit 7 */
#define  FMC_PATT_ATTHIZ3                  0xFF000000U        /*!<ATTHIZ3[7:0] bits (Attribute memory 3 databus HiZ time) */
#define  FMC_PATT_ATTHIZ3_0                0x01000000U        /*!<Bit 0 */
#define  FMC_PATT_ATTHIZ3_1                0x02000000U        /*!<Bit 1 */
#define  FMC_PATT_ATTHIZ3_2                0x04000000U        /*!<Bit 2 */
#define  FMC_PATT_ATTHIZ3_3                0x08000000U        /*!<Bit 3 */
#define  FMC_PATT_ATTHIZ3_4                0x10000000U        /*!<Bit 4 */
#define  FMC_PATT_ATTHIZ3_5                0x20000000U        /*!<Bit 5 */
#define  FMC_PATT_ATTHIZ3_6                0x40000000U        /*!<Bit 6 */
#define  FMC_PATT_ATTHIZ3_7                0x80000000U        /*!<Bit 7 */

/******************  Bit definition for FMC_ECCR register  ******************/
#define  FMC_ECCR_ECC3                     0xFFFFFFFFU        /*!<ECC result */

/******************  Bit definition for FMC_SDCR1 register  ******************/
#define  FMC_SDCR1_NC                       0x00000003U        /*!<NC[1:0] bits (Number of column bits) */
#define  FMC_SDCR1_NC_0                     0x00000001U        /*!<Bit 0 */
#define  FMC_SDCR1_NC_1                     0x00000002U        /*!<Bit 1 */
#define  FMC_SDCR1_NR                       0x0000000CU        /*!<NR[1:0] bits (Number of row bits) */
#define  FMC_SDCR1_NR_0                     0x00000004U        /*!<Bit 0 */
#define  FMC_SDCR1_NR_1                     0x00000008U        /*!<Bit 1 */
#define  FMC_SDCR1_MWID                     0x00000030U        /*!<NR[1:0] bits (Number of row bits) */
#define  FMC_SDCR1_MWID_0                   0x00000010U        /*!<Bit 0 */
#define  FMC_SDCR1_MWID_1                   0x00000020U        /*!<Bit 1 */
#define  FMC_SDCR1_NB                       0x00000040U        /*!<Number of internal bank */
#define  FMC_SDCR1_CAS                      0x00000180U        /*!<CAS[1:0] bits (CAS latency) */
#define  FMC_SDCR1_CAS_0                    0x00000080U        /*!<Bit 0 */
#define  FMC_SDCR1_CAS_1                    0x00000100U        /*!<Bit 1 */
#define  FMC_SDCR1_WP                       0x00000200U        /*!<Write protection */
#define  FMC_SDCR1_SDCLK                    0x00000C00U        /*!<SDRAM clock configuration */
#define  FMC_SDCR1_SDCLK_0                  0x00000400U        /*!<Bit 0 */
#define  FMC_SDCR1_SDCLK_1                  0x00000800U        /*!<Bit 1 */
#define  FMC_SDCR1_RBURST                   0x00001000U        /*!<Read burst */
#define  FMC_SDCR1_RPIPE                    0x00006000U        /*!<Write protection */
#define  FMC_SDCR1_RPIPE_0                  0x00002000U        /*!<Bit 0 */
#define  FMC_SDCR1_RPIPE_1                  0x00004000U        /*!<Bit 1 */

/******************  Bit definition for FMC_SDCR2 register  ******************/
#define  FMC_SDCR2_NC                       0x00000003U        /*!<NC[1:0] bits (Number of column bits) */
#define  FMC_SDCR2_NC_0                     0x00000001U        /*!<Bit 0 */
#define  FMC_SDCR2_NC_1                     0x00000002U        /*!<Bit 1 */
#define  FMC_SDCR2_NR                       0x0000000CU        /*!<NR[1:0] bits (Number of row bits) */
#define  FMC_SDCR2_NR_0                     0x00000004U        /*!<Bit 0 */
#define  FMC_SDCR2_NR_1                     0x00000008U        /*!<Bit 1 */
#define  FMC_SDCR2_MWID                     0x00000030U        /*!<NR[1:0] bits (Number of row bits) */
#define  FMC_SDCR2_MWID_0                   0x00000010U        /*!<Bit 0 */
#define  FMC_SDCR2_MWID_1                   0x00000020U        /*!<Bit 1 */
#define  FMC_SDCR2_NB                       0x00000040U        /*!<Number of internal bank */
#define  FMC_SDCR2_CAS                      0x00000180U        /*!<CAS[1:0] bits (CAS latency) */
#define  FMC_SDCR2_CAS_0                    0x00000080U        /*!<Bit 0 */
#define  FMC_SDCR2_CAS_1                    0x00000100U        /*!<Bit 1 */
#define  FMC_SDCR2_WP                       0x00000200U        /*!<Write protection */
#define  FMC_SDCR2_SDCLK                    0x00000C00U        /*!<SDCLK[1:0] (SDRAM clock configuration) */
#define  FMC_SDCR2_SDCLK_0                  0x00000400U        /*!<Bit 0 */
#define  FMC_SDCR2_SDCLK_1                  0x00000800U        /*!<Bit 1 */
#define  FMC_SDCR2_RBURST                   0x00001000U        /*!<Read burst */
#define  FMC_SDCR2_RPIPE                    0x00006000U        /*!<RPIPE[1:0](Read pipe) */
#define  FMC_SDCR2_RPIPE_0                  0x00002000U        /*!<Bit 0 */
#define  FMC_SDCR2_RPIPE_1                  0x00004000U        /*!<Bit 1 */

/******************  Bit definition for FMC_SDTR1 register  ******************/
#define  FMC_SDTR1_TMRD                     0x0000000FU        /*!<TMRD[3:0] bits (Load mode register to active) */
#define  FMC_SDTR1_TMRD_0                   0x00000001U        /*!<Bit 0 */
#define  FMC_SDTR1_TMRD_1                   0x00000002U        /*!<Bit 1 */
#define  FMC_SDTR1_TMRD_2                   0x00000004U        /*!<Bit 2 */
#define  FMC_SDTR1_TMRD_3                   0x00000008U        /*!<Bit 3 */
#define  FMC_SDTR1_TXSR                     0x000000F0U        /*!<TXSR[3:0] bits (Exit self refresh) */
#define  FMC_SDTR1_TXSR_0                   0x00000010U        /*!<Bit 0 */
#define  FMC_SDTR1_TXSR_1                   0x00000020U        /*!<Bit 1 */
#define  FMC_SDTR1_TXSR_2                   0x00000040U        /*!<Bit 2 */
#define  FMC_SDTR1_TXSR_3                   0x00000080U        /*!<Bit 3 */
#define  FMC_SDTR1_TRAS                     0x00000F00U        /*!<TRAS[3:0] bits (Self refresh time) */
#define  FMC_SDTR1_TRAS_0                   0x00000100U        /*!<Bit 0 */
#define  FMC_SDTR1_TRAS_1                   0x00000200U        /*!<Bit 1 */
#define  FMC_SDTR1_TRAS_2                   0x00000400U        /*!<Bit 2 */
#define  FMC_SDTR1_TRAS_3                   0x00000800U        /*!<Bit 3 */
#define  FMC_SDTR1_TRC                      0x0000F000U        /*!<TRC[2:0] bits (Row cycle delay) */
#define  FMC_SDTR1_TRC_0                    0x00001000U        /*!<Bit 0 */
#define  FMC_SDTR1_TRC_1                    0x00002000U        /*!<Bit 1 */
#define  FMC_SDTR1_TRC_2                    0x00004000U        /*!<Bit 2 */
#define  FMC_SDTR1_TWR                      0x000F0000U        /*!<TRC[2:0] bits (Write recovery delay) */
#define  FMC_SDTR1_TWR_0                    0x00010000U        /*!<Bit 0 */
#define  FMC_SDTR1_TWR_1                    0x00020000U        /*!<Bit 1 */
#define  FMC_SDTR1_TWR_2                    0x00040000U        /*!<Bit 2 */
#define  FMC_SDTR1_TRP                      0x00F00000U        /*!<TRP[2:0] bits (Row precharge delay) */
#define  FMC_SDTR1_TRP_0                    0x00100000U        /*!<Bit 0 */
#define  FMC_SDTR1_TRP_1                    0x00200000U        /*!<Bit 1 */
#define  FMC_SDTR1_TRP_2                    0x00400000U        /*!<Bit 2 */
#define  FMC_SDTR1_TRCD                     0x0F000000U        /*!<TRP[2:0] bits (Row to column delay) */
#define  FMC_SDTR1_TRCD_0                   0x01000000U        /*!<Bit 0 */
#define  FMC_SDTR1_TRCD_1                   0x02000000U        /*!<Bit 1 */
#define  FMC_SDTR1_TRCD_2                   0x04000000U        /*!<Bit 2 */

