micropython/micropython/stmhal/cmsis/stm32f767xx.h
/********************  Bit definition for CONFR4 register  *******************/
#define  JPEG_CONFR4_HD                          0x00000001U        /*!<Selects the Huffman table for encoding the DC coefficients */
#define  JPEG_CONFR4_HA                          0x00000002U        /*!<Selects the Huffman table for encoding the AC coefficients */
#define  JPEG_CONFR4_QT                          0x0000000CU        /*!<Selects quantization table associated with a color component */
#define  JPEG_CONFR4_QT_0                        0x00000004U        /*!<Bit 0 */
#define  JPEG_CONFR4_QT_1                        0x00000008U        /*!<Bit 1 */
#define  JPEG_CONFR4_NB                          0x000000F0U        /*!<Number of data units minus 1 that belong to a particular color in the MCU */
#define  JPEG_CONFR4_NB_0                        0x00000010U        /*!<Bit 0 */
#define  JPEG_CONFR4_NB_1                        0x00000020U        /*!<Bit 1 */
#define  JPEG_CONFR4_NB_2                        0x00000040U        /*!<Bit 2 */
#define  JPEG_CONFR4_NB_3                        0x00000080U        /*!<Bit 3 */
#define  JPEG_CONFR4_VSF                         0x00000F00U        /*!<Vertical sampling factor for component 1 */
#define  JPEG_CONFR4_VSF_0                       0x00000100U        /*!<Bit 0 */
#define  JPEG_CONFR4_VSF_1                       0x00000200U        /*!<Bit 1 */
#define  JPEG_CONFR4_VSF_2                       0x00000400U        /*!<Bit 2 */
#define  JPEG_CONFR4_VSF_3                       0x00000800U        /*!<Bit 3 */
#define  JPEG_CONFR4_HSF                         0x0000F000U        /*!<Horizontal sampling factor for component 1 */
#define  JPEG_CONFR4_HSF_0                       0x00001000U        /*!<Bit 0 */
#define  JPEG_CONFR4_HSF_1                       0x00002000U        /*!<Bit 1 */
#define  JPEG_CONFR4_HSF_2                       0x00004000U        /*!<Bit 2 */
#define  JPEG_CONFR4_HSF_3                       0x00008000U        /*!<Bit 3 */

/********************  Bit definition for CONFR5 register  *******************/
#define  JPEG_CONFR5_HD                          0x00000001U        /*!<Selects the Huffman table for encoding the DC coefficients */
#define  JPEG_CONFR5_HA                          0x00000002U        /*!<Selects the Huffman table for encoding the AC coefficients */
#define  JPEG_CONFR5_QT                          0x0000000CU        /*!<Selects quantization table associated with a color component */
#define  JPEG_CONFR5_QT_0                        0x00000004U        /*!<Bit 0 */
#define  JPEG_CONFR5_QT_1                        0x00000008U        /*!<Bit 1 */
#define  JPEG_CONFR5_NB                          0x000000F0U        /*!<Number of data units minus 1 that belong to a particular color in the MCU */
#define  JPEG_CONFR5_NB_0                        0x00000010U        /*!<Bit 0 */
#define  JPEG_CONFR5_NB_1                        0x00000020U        /*!<Bit 1 */
#define  JPEG_CONFR5_NB_2                        0x00000040U        /*!<Bit 2 */
#define  JPEG_CONFR5_NB_3                        0x00000080U        /*!<Bit 3 */
#define  JPEG_CONFR5_VSF                         0x00000F00U        /*!<Vertical sampling factor for component 2 */
#define  JPEG_CONFR5_VSF_0                       0x00000100U        /*!<Bit 0 */
#define  JPEG_CONFR5_VSF_1                       0x00000200U        /*!<Bit 1 */
#define  JPEG_CONFR5_VSF_2                       0x00000400U        /*!<Bit 2 */
#define  JPEG_CONFR5_VSF_3                       0x00000800U        /*!<Bit 3 */
#define  JPEG_CONFR5_HSF                         0x0000F000U        /*!<Horizontal sampling factor for component 2 */
#define  JPEG_CONFR5_HSF_0                       0x00001000U        /*!<Bit 0 */
#define  JPEG_CONFR5_HSF_1                       0x00002000U        /*!<Bit 1 */
#define  JPEG_CONFR5_HSF_2                       0x00004000U        /*!<Bit 2 */
#define  JPEG_CONFR5_HSF_3                       0x00008000U        /*!<Bit 3 */

/********************  Bit definition for CONFR6 register  *******************/
#define  JPEG_CONFR6_HD                          0x00000001U        /*!<Selects the Huffman table for encoding the DC coefficients */
#define  JPEG_CONFR6_HA                          0x00000002U        /*!<Selects the Huffman table for encoding the AC coefficients */
#define  JPEG_CONFR6_QT                          0x0000000CU        /*!<Selects quantization table associated with a color component */
#define  JPEG_CONFR6_QT_0                        0x00000004U        /*!<Bit 0 */
#define  JPEG_CONFR6_QT_1                        0x00000008U        /*!<Bit 1 */
#define  JPEG_CONFR6_NB                          0x000000F0U        /*!<Number of data units minus 1 that belong to a particular color in the MCU */
#define  JPEG_CONFR6_NB_0                        0x00000010U        /*!<Bit 0 */
#define  JPEG_CONFR6_NB_1                        0x00000020U        /*!<Bit 1 */
#define  JPEG_CONFR6_NB_2                        0x00000040U        /*!<Bit 2 */
#define  JPEG_CONFR6_NB_3                        0x00000080U        /*!<Bit 3 */
#define  JPEG_CONFR6_VSF                         0x00000F00U        /*!<Vertical sampling factor for component 2 */
#define  JPEG_CONFR6_VSF_0                       0x00000100U        /*!<Bit 0 */
#define  JPEG_CONFR6_VSF_1                       0x00000200U        /*!<Bit 1 */
#define  JPEG_CONFR6_VSF_2                       0x00000400U        /*!<Bit 2 */
#define  JPEG_CONFR6_VSF_3                       0x00000800U        /*!<Bit 3 */
#define  JPEG_CONFR6_HSF                         0x0000F000U        /*!<Horizontal sampling factor for component 2 */
#define  JPEG_CONFR6_HSF_0                       0x00001000U        /*!<Bit 0 */
#define  JPEG_CONFR6_HSF_1                       0x00002000U        /*!<Bit 1 */
#define  JPEG_CONFR6_HSF_2                       0x00004000U        /*!<Bit 2 */
#define  JPEG_CONFR6_HSF_3                       0x00008000U        /*!<Bit 3 */

/********************  Bit definition for CONFR7 register  *******************/
#define  JPEG_CONFR7_HD                          0x00000001U        /*!<Selects the Huffman table for encoding the DC coefficients */
#define  JPEG_CONFR7_HA                          0x00000002U        /*!<Selects the Huffman table for encoding the AC coefficients */
#define  JPEG_CONFR7_QT                          0x0000000CU        /*!<Selects quantization table associated with a color component */
#define  JPEG_CONFR7_QT_0                        0x00000004U        /*!<Bit 0 */
#define  JPEG_CONFR7_QT_1                        0x00000008U        /*!<Bit 1 */
#define  JPEG_CONFR7_NB                          0x000000F0U        /*!<Number of data units minus 1 that belong to a particular color in the MCU */
#define  JPEG_CONFR7_NB_0                        0x00000010U        /*!<Bit 0 */
#define  JPEG_CONFR7_NB_1                        0x00000020U        /*!<Bit 1 */
#define  JPEG_CONFR7_NB_2                        0x00000040U        /*!<Bit 2 */
#define  JPEG_CONFR7_NB_3                        0x00000080U        /*!<Bit 3 */
#define  JPEG_CONFR7_VSF                         0x00000F00U        /*!<Vertical sampling factor for component 2 */
#define  JPEG_CONFR7_VSF_0                       0x00000100U        /*!<Bit 0 */
#define  JPEG_CONFR7_VSF_1                       0x00000200U        /*!<Bit 1 */
#define  JPEG_CONFR7_VSF_2                       0x00000400U        /*!<Bit 2 */
#define  JPEG_CONFR7_VSF_3                       0x00000800U        /*!<Bit 3 */
#define  JPEG_CONFR7_HSF                         0x0000F000U        /*!<Horizontal sampling factor for component 2 */
#define  JPEG_CONFR7_HSF_0                       0x00001000U        /*!<Bit 0 */
#define  JPEG_CONFR7_HSF_1                       0x00002000U        /*!<Bit 1 */
#define  JPEG_CONFR7_HSF_2                       0x00004000U        /*!<Bit 2 */
#define  JPEG_CONFR7_HSF_3                       0x00008000U        /*!<Bit 3 */

/********************  Bit definition for CR register  *******************/
#define  JPEG_CR_JCEN                            0x00000001U        /*!<Enable the JPEG Codec Core */
#define  JPEG_CR_IFTIE                           0x00000002U        /*!<Input FIFO Threshold Interrupt Enable */
#define  JPEG_CR_IFNFIE                          0x00000004U        /*!<Input FIFO Not Full Interrupt Enable */
#define  JPEG_CR_OFTIE                           0x00000008U        /*!<Output FIFO Threshold Interrupt Enable */
#define  JPEG_CR_OFNEIE                          0x00000010U        /*!<Output FIFO Not Empty Interrupt Enable */
#define  JPEG_CR_EOCIE                           0x00000020U        /*!<End of Conversion Interrupt Enable */
#define  JPEG_CR_HPDIE                           0x00000040U        /*!<Header Parsing Done Interrupt Enable */
#define  JPEG_CR_IDMAEN                          0x00000800U        /*!<Enable the DMA request generation for the input FIFO */
#define  JPEG_CR_ODMAEN                          0x00001000U        /*!<Enable the DMA request generation for the output FIFO */
#define  JPEG_CR_IFF                             0x00002000U        /*!<Flush the input FIFO */
#define  JPEG_CR_OFF                             0x00004000U        /*!<Flush the output FIFO */

